# Ввести натуральное число и проверить, представимо ли оно в виде суммы кубов двух натуральных чисел.
# Вывести YES или NO. Придумать алгоритм поэффективнее.

from math import*
s = "NO"
a = int(input())
b = floor(a**(1/3.0))
for i in range(b+1):
    c = f = (a - (i ** 3))
    f = f**(1/3.0)
    f = ceil(f)
    if f**3 == c:
        s = "YES"
        break
print(s)
